---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LightDistribution Properties
LightDistribution Class See Also Send Feedback
---

The LightDistribution type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

LightDistribution Class

Autodesk.Revit.DB.Lighting Namespace